## [testlargerepo](https://daniellem97.app.spacelift.io/stack/testlargerepo/run/01HCCTAC2B153XC4PTXE2X4ZMX) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HCAE4P5SYQE9H2BX0K9P4FBM] Planning changes with 0 custom hooks...
data.aws_ami.server_ami: Reading...
aws_vpc.mtc_vpc: Refreshing state... [id=vpc-0b4252d20f65f84f0]
data.aws_ami.server_ami: Read complete after 0s [id=ami-0a588942e90cfecc9]
aws_route_table.mtc_public_rt: Refreshing state... [id=rtb-05fe1232e44e89a58]
aws_internet_gateway.mtc_internet_gateway: Refreshing state... [id=igw-089da49a6ed26dabe]
aws_security_group.mtc_sg: Refreshing state... [id=sg-0aab208af27f52edc]
aws_subnet.mtc_public_subnet: Refreshing state... [id=subnet-0a2732c934d54895a]
aws_route_table_association.mtc_public_assoc: Refreshing state... [id=rtbassoc-09f624350ebd96e14]
aws_route.default_route: Refreshing state... [id=r-rtb-05fe1232e44e89a581080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.dev_node will be created
  + resource "aws_instance" "dev_node" {
      + ami                                  = "ami-0a588942e90cfecc9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0a2732c934d54895a"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "315436d8a3399146b37d7460990773856beae69b"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0aab208af27f52edc",
        ]

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 10
          + volume_type           = (known after apply)
        }
    }

  # aws_key_pair.mtc_auth will be created
  + resource "aws_key_pair" "mtc_auth" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "mtckey2"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCpyqbN5YjL9KJbjECZ5XabhMdmp/sZOZKkcu7qMtalRDBQU7IHKrgsECXsHSrbmI393VUXgL8qnYMq6XHYVEK8u+D70pXuZaKoTYRyvnwaRbXm324RiyBjInfUVLOGN3x+dkZ2PSSm3G71AVQT6zJVHd2drESyNSYZkITI8XfmuZqTnXOtkfK/cYwnljy4hghN6uC+aTc5F40o8pfXRZMdeE/263pmBtYaWF15/iSp0lO+SAuRYXRevGj0icKLelLSU6X+OrnlVJrxXbxFsfou3CSyY5fN61jSLjQete/O4TLBl0pac5TqBlqUCQQ5kw9OMbk0n47f/jJmn4yQphEbz7Ob0vPm01O+hsLgWpUkrTlROfWy0b9WaoelbakSbdDUvJq9ha8Xh/iPeShszE8ymuItL/NSOJEJw7W4uriULouRg2GmKFQ96zFoAjfAh4z+igDh1fCJCDcC5CjsV9LbsMoxQ/FNZAFcvOWXnQBUkVEGmvkyoeIg8HfFmWv2Hes= daniellemurphy@Danielles-MacBook-Air.local"
      + tags_all        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dev_ip = (known after apply)
[01HCAE4P5SYQE9H2BX0K9P4FBM] Changes are GO
[01HCAE4P5SYQE9H2BX0K9P4FBM] Uploading the list of managed resources...
[01HCAE4P5SYQE9H2BX0K9P4FBM] Please be aware that the run changes calculation includes output changes.
[01HCAE4P5SYQE9H2BX0K9P4FBM] Resource list upload is GO
[01HCAE4P5SYQE9H2BX0K9P4FBM] Generating JSON representation of the plan...
[01HCAE4P5SYQE9H2BX0K9P4FBM] JSON representation is GO
[01HCAE4P5SYQE9H2BX0K9P4FBM] Loading custom plan policy inputs...
[01HCAE4P5SYQE9H2BX0K9P4FBM] 0 custom plan policy inputs found
[01HCAE4P5SYQE9H2BX0K9P4FBM] No plan policies to evaluate
```

</details>